Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/pwm.h
#define PWM_CH7_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH7_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH7_CSR_B_INV_MSB    _u(3)
#define PWM_CH7_CSR_B_INV_LSB    _u(3)
#define PWM_CH7_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_CSR_A_INV
// Description : Invert output A
#define PWM_CH7_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH7_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH7_CSR_A_INV_MSB    _u(2)
#define PWM_CH7_CSR_A_INV_LSB    _u(2)
#define PWM_CH7_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH7_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH7_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH7_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH7_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH7_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH7_CSR_EN_RESET  _u(0x0)
#define PWM_CH7_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH7_CSR_EN_MSB    _u(0)
#define PWM_CH7_CSR_EN_LSB    _u(0)
#define PWM_CH7_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH7_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH7_DIV_OFFSET _u(0x00000090)
#define PWM_CH7_DIV_BITS   _u(0x00000fff)
#define PWM_CH7_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_DIV_INT
#define PWM_CH7_DIV_INT_RESET  _u(0x01)
#define PWM_CH7_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH7_DIV_INT_MSB    _u(11)
#define PWM_CH7_DIV_INT_LSB    _u(4)
#define PWM_CH7_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_DIV_FRAC
#define PWM_CH7_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH7_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH7_DIV_FRAC_MSB    _u(3)
#define PWM_CH7_DIV_FRAC_LSB    _u(0)
#define PWM_CH7_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH7_CTR
// Description : Direct access to the PWM counter
#define PWM_CH7_CTR_OFFSET _u(0x00000094)
#define PWM_CH7_CTR_BITS   _u(0x0000ffff)
#define PWM_CH7_CTR_RESET  _u(0x00000000)
#define PWM_CH7_CTR_MSB    _u(15)
#define PWM_CH7_CTR_LSB    _u(0)
#define PWM_CH7_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH7_CC
// Description : Counter compare values
#define PWM_CH7_CC_OFFSET _u(0x00000098)
#define PWM_CH7_CC_BITS   _u(0xffffffff)
#define PWM_CH7_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_CC_B
#define PWM_CH7_CC_B_RESET  _u(0x0000)
#define PWM_CH7_CC_B_BITS   _u(0xffff0000)
#define PWM_CH7_CC_B_MSB    _u(31)
#define PWM_CH7_CC_B_LSB    _u(16)
#define PWM_CH7_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_CC_A
#define PWM_CH7_CC_A_RESET  _u(0x0000)
#define PWM_CH7_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH7_CC_A_MSB    _u(15)
#define PWM_CH7_CC_A_LSB    _u(0)
#define PWM_CH7_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH7_TOP
// Description : Counter wrap value
#define PWM_CH7_TOP_OFFSET _u(0x0000009c)
#define PWM_CH7_TOP_BITS   _u(0x0000ffff)
#define PWM_CH7_TOP_RESET  _u(0x0000ffff)
#define PWM_CH7_TOP_MSB    _u(15)
#define PWM_CH7_TOP_LSB    _u(0)
#define PWM_CH7_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH8_CSR
// Description : Control and status register
#define PWM_CH8_CSR_OFFSET _u(0x000000a0)
#define PWM_CH8_CSR_BITS   _u(0x000000ff)
#define PWM_CH8_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH8_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH8_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH8_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH8_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH8_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH8_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH8_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH8_CSR_PH_RET_MSB    _u(6)
#define PWM_CH8_CSR_PH_RET_LSB    _u(6)
#define PWM_CH8_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CSR_DIVMODE
//               0x0 -> Free-running counting at rate dictated by fractional divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B pin.
#define PWM_CH8_CSR_DIVMODE_RESET  _u(0x0)
#define PWM_CH8_CSR_DIVMODE_BITS   _u(0x00000030)
#define PWM_CH8_CSR_DIVMODE_MSB    _u(5)
#define PWM_CH8_CSR_DIVMODE_LSB    _u(4)
#define PWM_CH8_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH8_CSR_DIVMODE_VALUE_DIV _u(0x0)
#define PWM_CH8_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH8_CSR_DIVMODE_VALUE_RISE _u(0x2)
#define PWM_CH8_CSR_DIVMODE_VALUE_FALL _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CSR_B_INV
// Description : Invert output B
#define PWM_CH8_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH8_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH8_CSR_B_INV_MSB    _u(3)
#define PWM_CH8_CSR_B_INV_LSB    _u(3)
#define PWM_CH8_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CSR_A_INV
// Description : Invert output A
#define PWM_CH8_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH8_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH8_CSR_A_INV_MSB    _u(2)
#define PWM_CH8_CSR_A_INV_LSB    _u(2)
#define PWM_CH8_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH8_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH8_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH8_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH8_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH8_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH8_CSR_EN_RESET  _u(0x0)
#define PWM_CH8_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH8_CSR_EN_MSB    _u(0)
#define PWM_CH8_CSR_EN_LSB    _u(0)
#define PWM_CH8_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH8_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH8_DIV_OFFSET _u(0x000000a4)
#define PWM_CH8_DIV_BITS   _u(0x00000fff)
#define PWM_CH8_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_DIV_INT
#define PWM_CH8_DIV_INT_RESET  _u(0x01)
#define PWM_CH8_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH8_DIV_INT_MSB    _u(11)
#define PWM_CH8_DIV_INT_LSB    _u(4)
#define PWM_CH8_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_DIV_FRAC
#define PWM_CH8_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH8_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH8_DIV_FRAC_MSB    _u(3)
#define PWM_CH8_DIV_FRAC_LSB    _u(0)
#define PWM_CH8_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH8_CTR
// Description : Direct access to the PWM counter
#define PWM_CH8_CTR_OFFSET _u(0x000000a8)
#define PWM_CH8_CTR_BITS   _u(0x0000ffff)
#define PWM_CH8_CTR_RESET  _u(0x00000000)
#define PWM_CH8_CTR_MSB    _u(15)
#define PWM_CH8_CTR_LSB    _u(0)
#define PWM_CH8_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH8_CC
// Description : Counter compare values
#define PWM_CH8_CC_OFFSET _u(0x000000ac)
#define PWM_CH8_CC_BITS   _u(0xffffffff)
#define PWM_CH8_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CC_B
#define PWM_CH8_CC_B_RESET  _u(0x0000)
#define PWM_CH8_CC_B_BITS   _u(0xffff0000)
#define PWM_CH8_CC_B_MSB    _u(31)
#define PWM_CH8_CC_B_LSB    _u(16)
#define PWM_CH8_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH8_CC_A
#define PWM_CH8_CC_A_RESET  _u(0x0000)
#define PWM_CH8_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH8_CC_A_MSB    _u(15)
#define PWM_CH8_CC_A_LSB    _u(0)
#define PWM_CH8_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH8_TOP
// Description : Counter wrap value
#define PWM_CH8_TOP_OFFSET _u(0x000000b0)
#define PWM_CH8_TOP_BITS   _u(0x0000ffff)
#define PWM_CH8_TOP_RESET  _u(0x0000ffff)
#define PWM_CH8_TOP_MSB    _u(15)
#define PWM_CH8_TOP_LSB    _u(0)
#define PWM_CH8_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH9_CSR
// Description : Control and status register
#define PWM_CH9_CSR_OFFSET _u(0x000000b4)
#define PWM_CH9_CSR_BITS   _u(0x000000ff)
#define PWM_CH9_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH9_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH9_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH9_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH9_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH9_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH9_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH9_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH9_CSR_PH_RET_MSB    _u(6)
#define PWM_CH9_CSR_PH_RET_LSB    _u(6)
#define PWM_CH9_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CSR_DIVMODE
//               0x0 -> Free-running counting at rate dictated by fractional divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B pin.
#define PWM_CH9_CSR_DIVMODE_RESET  _u(0x0)
#define PWM_CH9_CSR_DIVMODE_BITS   _u(0x00000030)
#define PWM_CH9_CSR_DIVMODE_MSB    _u(5)
#define PWM_CH9_CSR_DIVMODE_LSB    _u(4)
#define PWM_CH9_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH9_CSR_DIVMODE_VALUE_DIV _u(0x0)
#define PWM_CH9_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH9_CSR_DIVMODE_VALUE_RISE _u(0x2)
#define PWM_CH9_CSR_DIVMODE_VALUE_FALL _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CSR_B_INV
// Description : Invert output B
#define PWM_CH9_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH9_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH9_CSR_B_INV_MSB    _u(3)
#define PWM_CH9_CSR_B_INV_LSB    _u(3)
#define PWM_CH9_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CSR_A_INV
// Description : Invert output A
#define PWM_CH9_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH9_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH9_CSR_A_INV_MSB    _u(2)
#define PWM_CH9_CSR_A_INV_LSB    _u(2)
#define PWM_CH9_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH9_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH9_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH9_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH9_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH9_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH9_CSR_EN_RESET  _u(0x0)
#define PWM_CH9_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH9_CSR_EN_MSB    _u(0)
#define PWM_CH9_CSR_EN_LSB    _u(0)
#define PWM_CH9_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH9_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH9_DIV_OFFSET _u(0x000000b8)
#define PWM_CH9_DIV_BITS   _u(0x00000fff)
#define PWM_CH9_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_DIV_INT
#define PWM_CH9_DIV_INT_RESET  _u(0x01)
#define PWM_CH9_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH9_DIV_INT_MSB    _u(11)
#define PWM_CH9_DIV_INT_LSB    _u(4)
#define PWM_CH9_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_DIV_FRAC
#define PWM_CH9_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH9_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH9_DIV_FRAC_MSB    _u(3)
#define PWM_CH9_DIV_FRAC_LSB    _u(0)
#define PWM_CH9_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH9_CTR
// Description : Direct access to the PWM counter
#define PWM_CH9_CTR_OFFSET _u(0x000000bc)
#define PWM_CH9_CTR_BITS   _u(0x0000ffff)
#define PWM_CH9_CTR_RESET  _u(0x00000000)
#define PWM_CH9_CTR_MSB    _u(15)
#define PWM_CH9_CTR_LSB    _u(0)
#define PWM_CH9_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH9_CC
// Description : Counter compare values
#define PWM_CH9_CC_OFFSET _u(0x000000c0)
#define PWM_CH9_CC_BITS   _u(0xffffffff)
#define PWM_CH9_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CC_B
#define PWM_CH9_CC_B_RESET  _u(0x0000)
#define PWM_CH9_CC_B_BITS   _u(0xffff0000)
#define PWM_CH9_CC_B_MSB    _u(31)
#define PWM_CH9_CC_B_LSB    _u(16)
#define PWM_CH9_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH9_CC_A
#define PWM_CH9_CC_A_RESET  _u(0x0000)
#define PWM_CH9_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH9_CC_A_MSB    _u(15)
#define PWM_CH9_CC_A_LSB    _u(0)
#define PWM_CH9_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH9_TOP
// Description : Counter wrap value
#define PWM_CH9_TOP_OFFSET _u(0x000000c4)
#define PWM_CH9_TOP_BITS   _u(0x0000ffff)
#define PWM_CH9_TOP_RESET  _u(0x0000ffff)
#define PWM_CH9_TOP_MSB    _u(15)
#define PWM_CH9_TOP_LSB    _u(0)
#define PWM_CH9_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH10_CSR
// Description : Control and status register
#define PWM_CH10_CSR_OFFSET _u(0x000000c8)
#define PWM_CH10_CSR_BITS   _u(0x000000ff)
#define PWM_CH10_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH10_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH10_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH10_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH10_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH10_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH10_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH10_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH10_CSR_PH_RET_MSB    _u(6)
#define PWM_CH10_CSR_PH_RET_LSB    _u(6)
#define PWM_CH10_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CSR_DIVMODE
//               0x0 -> Free-running counting at rate dictated by fractional divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B pin.
#define PWM_CH10_CSR_DIVMODE_RESET  _u(0x0)
#define PWM_CH10_CSR_DIVMODE_BITS   _u(0x00000030)
#define PWM_CH10_CSR_DIVMODE_MSB    _u(5)
#define PWM_CH10_CSR_DIVMODE_LSB    _u(4)
#define PWM_CH10_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH10_CSR_DIVMODE_VALUE_DIV _u(0x0)
#define PWM_CH10_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH10_CSR_DIVMODE_VALUE_RISE _u(0x2)
#define PWM_CH10_CSR_DIVMODE_VALUE_FALL _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CSR_B_INV
// Description : Invert output B
#define PWM_CH10_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH10_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH10_CSR_B_INV_MSB    _u(3)
#define PWM_CH10_CSR_B_INV_LSB    _u(3)
#define PWM_CH10_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CSR_A_INV
// Description : Invert output A
#define PWM_CH10_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH10_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH10_CSR_A_INV_MSB    _u(2)
#define PWM_CH10_CSR_A_INV_LSB    _u(2)
#define PWM_CH10_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH10_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH10_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH10_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH10_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH10_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH10_CSR_EN_RESET  _u(0x0)
#define PWM_CH10_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH10_CSR_EN_MSB    _u(0)
#define PWM_CH10_CSR_EN_LSB    _u(0)
#define PWM_CH10_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH10_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH10_DIV_OFFSET _u(0x000000cc)
#define PWM_CH10_DIV_BITS   _u(0x00000fff)
#define PWM_CH10_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_DIV_INT
#define PWM_CH10_DIV_INT_RESET  _u(0x01)
#define PWM_CH10_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH10_DIV_INT_MSB    _u(11)
#define PWM_CH10_DIV_INT_LSB    _u(4)
#define PWM_CH10_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_DIV_FRAC
#define PWM_CH10_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH10_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH10_DIV_FRAC_MSB    _u(3)
#define PWM_CH10_DIV_FRAC_LSB    _u(0)
#define PWM_CH10_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH10_CTR
// Description : Direct access to the PWM counter
#define PWM_CH10_CTR_OFFSET _u(0x000000d0)
#define PWM_CH10_CTR_BITS   _u(0x0000ffff)
#define PWM_CH10_CTR_RESET  _u(0x00000000)
#define PWM_CH10_CTR_MSB    _u(15)
#define PWM_CH10_CTR_LSB    _u(0)
#define PWM_CH10_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH10_CC
// Description : Counter compare values
#define PWM_CH10_CC_OFFSET _u(0x000000d4)
#define PWM_CH10_CC_BITS   _u(0xffffffff)
#define PWM_CH10_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CC_B
#define PWM_CH10_CC_B_RESET  _u(0x0000)
#define PWM_CH10_CC_B_BITS   _u(0xffff0000)
#define PWM_CH10_CC_B_MSB    _u(31)
#define PWM_CH10_CC_B_LSB    _u(16)
#define PWM_CH10_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH10_CC_A
#define PWM_CH10_CC_A_RESET  _u(0x0000)
#define PWM_CH10_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH10_CC_A_MSB    _u(15)
#define PWM_CH10_CC_A_LSB    _u(0)
#define PWM_CH10_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH10_TOP
// Description : Counter wrap value
#define PWM_CH10_TOP_OFFSET _u(0x000000d8)
#define PWM_CH10_TOP_BITS   _u(0x0000ffff)
#define PWM_CH10_TOP_RESET  _u(0x0000ffff)
#define PWM_CH10_TOP_MSB    _u(15)
#define PWM_CH10_TOP_LSB    _u(0)
#define PWM_CH10_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH11_CSR
// Description : Control and status register
#define PWM_CH11_CSR_OFFSET _u(0x000000dc)
#define PWM_CH11_CSR_BITS   _u(0x000000ff)
#define PWM_CH11_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH11_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
