Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/pwm.h
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ0_INTS_CH6
#define PWM_IRQ0_INTS_CH6_RESET  _u(0x0)
#define PWM_IRQ0_INTS_CH6_BITS   _u(0x00000040)
#define PWM_IRQ0_INTS_CH6_MSB    _u(6)
#define PWM_IRQ0_INTS_CH6_LSB    _u(6)
#define PWM_IRQ0_INTS_CH6_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ0_INTS_CH5
#define PWM_IRQ0_INTS_CH5_RESET  _u(0x0)
#define PWM_IRQ0_INTS_CH5_BITS   _u(0x00000020)
#define PWM_IRQ0_INTS_CH5_MSB    _u(5)
#define PWM_IRQ0_INTS_CH5_LSB    _u(5)
#define PWM_IRQ0_INTS_CH5_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ0_INTS_CH4
#define PWM_IRQ0_INTS_CH4_RESET  _u(0x0)
#define PWM_IRQ0_INTS_CH4_BITS   _u(0x00000010)
#define PWM_IRQ0_INTS_CH4_MSB    _u(4)
#define PWM_IRQ0_INTS_CH4_LSB    _u(4)
#define PWM_IRQ0_INTS_CH4_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ0_INTS_CH3
#define PWM_IRQ0_INTS_CH3_RESET  _u(0x0)
#define PWM_IRQ0_INTS_CH3_BITS   _u(0x00000008)
#define PWM_IRQ0_INTS_CH3_MSB    _u(3)
#define PWM_IRQ0_INTS_CH3_LSB    _u(3)
#define PWM_IRQ0_INTS_CH3_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ0_INTS_CH2
#define PWM_IRQ0_INTS_CH2_RESET  _u(0x0)
#define PWM_IRQ0_INTS_CH2_BITS   _u(0x00000004)
#define PWM_IRQ0_INTS_CH2_MSB    _u(2)
#define PWM_IRQ0_INTS_CH2_LSB    _u(2)
#define PWM_IRQ0_INTS_CH2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ0_INTS_CH1
#define PWM_IRQ0_INTS_CH1_RESET  _u(0x0)
#define PWM_IRQ0_INTS_CH1_BITS   _u(0x00000002)
#define PWM_IRQ0_INTS_CH1_MSB    _u(1)
#define PWM_IRQ0_INTS_CH1_LSB    _u(1)
#define PWM_IRQ0_INTS_CH1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ0_INTS_CH0
#define PWM_IRQ0_INTS_CH0_RESET  _u(0x0)
#define PWM_IRQ0_INTS_CH0_BITS   _u(0x00000001)
#define PWM_IRQ0_INTS_CH0_MSB    _u(0)
#define PWM_IRQ0_INTS_CH0_LSB    _u(0)
#define PWM_IRQ0_INTS_CH0_ACCESS "RO"
// =============================================================================
// Register    : PWM_IRQ1_INTE
// Description : Interrupt Enable for irq1
#define PWM_IRQ1_INTE_OFFSET _u(0x00000104)
#define PWM_IRQ1_INTE_BITS   _u(0x00000fff)
#define PWM_IRQ1_INTE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH11
#define PWM_IRQ1_INTE_CH11_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH11_BITS   _u(0x00000800)
#define PWM_IRQ1_INTE_CH11_MSB    _u(11)
#define PWM_IRQ1_INTE_CH11_LSB    _u(11)
#define PWM_IRQ1_INTE_CH11_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH10
#define PWM_IRQ1_INTE_CH10_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH10_BITS   _u(0x00000400)
#define PWM_IRQ1_INTE_CH10_MSB    _u(10)
#define PWM_IRQ1_INTE_CH10_LSB    _u(10)
#define PWM_IRQ1_INTE_CH10_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH9
#define PWM_IRQ1_INTE_CH9_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH9_BITS   _u(0x00000200)
#define PWM_IRQ1_INTE_CH9_MSB    _u(9)
#define PWM_IRQ1_INTE_CH9_LSB    _u(9)
#define PWM_IRQ1_INTE_CH9_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH8
#define PWM_IRQ1_INTE_CH8_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH8_BITS   _u(0x00000100)
#define PWM_IRQ1_INTE_CH8_MSB    _u(8)
#define PWM_IRQ1_INTE_CH8_LSB    _u(8)
#define PWM_IRQ1_INTE_CH8_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH7
#define PWM_IRQ1_INTE_CH7_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH7_BITS   _u(0x00000080)
#define PWM_IRQ1_INTE_CH7_MSB    _u(7)
#define PWM_IRQ1_INTE_CH7_LSB    _u(7)
#define PWM_IRQ1_INTE_CH7_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH6
#define PWM_IRQ1_INTE_CH6_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH6_BITS   _u(0x00000040)
#define PWM_IRQ1_INTE_CH6_MSB    _u(6)
#define PWM_IRQ1_INTE_CH6_LSB    _u(6)
#define PWM_IRQ1_INTE_CH6_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH5
#define PWM_IRQ1_INTE_CH5_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH5_BITS   _u(0x00000020)
#define PWM_IRQ1_INTE_CH5_MSB    _u(5)
#define PWM_IRQ1_INTE_CH5_LSB    _u(5)
#define PWM_IRQ1_INTE_CH5_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH4
#define PWM_IRQ1_INTE_CH4_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH4_BITS   _u(0x00000010)
#define PWM_IRQ1_INTE_CH4_MSB    _u(4)
#define PWM_IRQ1_INTE_CH4_LSB    _u(4)
#define PWM_IRQ1_INTE_CH4_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH3
#define PWM_IRQ1_INTE_CH3_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH3_BITS   _u(0x00000008)
#define PWM_IRQ1_INTE_CH3_MSB    _u(3)
#define PWM_IRQ1_INTE_CH3_LSB    _u(3)
#define PWM_IRQ1_INTE_CH3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH2
#define PWM_IRQ1_INTE_CH2_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH2_BITS   _u(0x00000004)
#define PWM_IRQ1_INTE_CH2_MSB    _u(2)
#define PWM_IRQ1_INTE_CH2_LSB    _u(2)
#define PWM_IRQ1_INTE_CH2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH1
#define PWM_IRQ1_INTE_CH1_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH1_BITS   _u(0x00000002)
#define PWM_IRQ1_INTE_CH1_MSB    _u(1)
#define PWM_IRQ1_INTE_CH1_LSB    _u(1)
#define PWM_IRQ1_INTE_CH1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTE_CH0
#define PWM_IRQ1_INTE_CH0_RESET  _u(0x0)
#define PWM_IRQ1_INTE_CH0_BITS   _u(0x00000001)
#define PWM_IRQ1_INTE_CH0_MSB    _u(0)
#define PWM_IRQ1_INTE_CH0_LSB    _u(0)
#define PWM_IRQ1_INTE_CH0_ACCESS "RW"
// =============================================================================
// Register    : PWM_IRQ1_INTF
// Description : Interrupt Force for irq1
#define PWM_IRQ1_INTF_OFFSET _u(0x00000108)
#define PWM_IRQ1_INTF_BITS   _u(0x00000fff)
#define PWM_IRQ1_INTF_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH11
#define PWM_IRQ1_INTF_CH11_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH11_BITS   _u(0x00000800)
#define PWM_IRQ1_INTF_CH11_MSB    _u(11)
#define PWM_IRQ1_INTF_CH11_LSB    _u(11)
#define PWM_IRQ1_INTF_CH11_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH10
#define PWM_IRQ1_INTF_CH10_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH10_BITS   _u(0x00000400)
#define PWM_IRQ1_INTF_CH10_MSB    _u(10)
#define PWM_IRQ1_INTF_CH10_LSB    _u(10)
#define PWM_IRQ1_INTF_CH10_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH9
#define PWM_IRQ1_INTF_CH9_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH9_BITS   _u(0x00000200)
#define PWM_IRQ1_INTF_CH9_MSB    _u(9)
#define PWM_IRQ1_INTF_CH9_LSB    _u(9)
#define PWM_IRQ1_INTF_CH9_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH8
#define PWM_IRQ1_INTF_CH8_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH8_BITS   _u(0x00000100)
#define PWM_IRQ1_INTF_CH8_MSB    _u(8)
#define PWM_IRQ1_INTF_CH8_LSB    _u(8)
#define PWM_IRQ1_INTF_CH8_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH7
#define PWM_IRQ1_INTF_CH7_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH7_BITS   _u(0x00000080)
#define PWM_IRQ1_INTF_CH7_MSB    _u(7)
#define PWM_IRQ1_INTF_CH7_LSB    _u(7)
#define PWM_IRQ1_INTF_CH7_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH6
#define PWM_IRQ1_INTF_CH6_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH6_BITS   _u(0x00000040)
#define PWM_IRQ1_INTF_CH6_MSB    _u(6)
#define PWM_IRQ1_INTF_CH6_LSB    _u(6)
#define PWM_IRQ1_INTF_CH6_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH5
#define PWM_IRQ1_INTF_CH5_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH5_BITS   _u(0x00000020)
#define PWM_IRQ1_INTF_CH5_MSB    _u(5)
#define PWM_IRQ1_INTF_CH5_LSB    _u(5)
#define PWM_IRQ1_INTF_CH5_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH4
#define PWM_IRQ1_INTF_CH4_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH4_BITS   _u(0x00000010)
#define PWM_IRQ1_INTF_CH4_MSB    _u(4)
#define PWM_IRQ1_INTF_CH4_LSB    _u(4)
#define PWM_IRQ1_INTF_CH4_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH3
#define PWM_IRQ1_INTF_CH3_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH3_BITS   _u(0x00000008)
#define PWM_IRQ1_INTF_CH3_MSB    _u(3)
#define PWM_IRQ1_INTF_CH3_LSB    _u(3)
#define PWM_IRQ1_INTF_CH3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH2
#define PWM_IRQ1_INTF_CH2_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH2_BITS   _u(0x00000004)
#define PWM_IRQ1_INTF_CH2_MSB    _u(2)
#define PWM_IRQ1_INTF_CH2_LSB    _u(2)
#define PWM_IRQ1_INTF_CH2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH1
#define PWM_IRQ1_INTF_CH1_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH1_BITS   _u(0x00000002)
#define PWM_IRQ1_INTF_CH1_MSB    _u(1)
#define PWM_IRQ1_INTF_CH1_LSB    _u(1)
#define PWM_IRQ1_INTF_CH1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTF_CH0
#define PWM_IRQ1_INTF_CH0_RESET  _u(0x0)
#define PWM_IRQ1_INTF_CH0_BITS   _u(0x00000001)
#define PWM_IRQ1_INTF_CH0_MSB    _u(0)
#define PWM_IRQ1_INTF_CH0_LSB    _u(0)
#define PWM_IRQ1_INTF_CH0_ACCESS "RW"
// =============================================================================
// Register    : PWM_IRQ1_INTS
// Description : Interrupt status after masking & forcing for irq1
#define PWM_IRQ1_INTS_OFFSET _u(0x0000010c)
#define PWM_IRQ1_INTS_BITS   _u(0x00000fff)
#define PWM_IRQ1_INTS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH11
#define PWM_IRQ1_INTS_CH11_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH11_BITS   _u(0x00000800)
#define PWM_IRQ1_INTS_CH11_MSB    _u(11)
#define PWM_IRQ1_INTS_CH11_LSB    _u(11)
#define PWM_IRQ1_INTS_CH11_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH10
#define PWM_IRQ1_INTS_CH10_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH10_BITS   _u(0x00000400)
#define PWM_IRQ1_INTS_CH10_MSB    _u(10)
#define PWM_IRQ1_INTS_CH10_LSB    _u(10)
#define PWM_IRQ1_INTS_CH10_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH9
#define PWM_IRQ1_INTS_CH9_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH9_BITS   _u(0x00000200)
#define PWM_IRQ1_INTS_CH9_MSB    _u(9)
#define PWM_IRQ1_INTS_CH9_LSB    _u(9)
#define PWM_IRQ1_INTS_CH9_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH8
#define PWM_IRQ1_INTS_CH8_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH8_BITS   _u(0x00000100)
#define PWM_IRQ1_INTS_CH8_MSB    _u(8)
#define PWM_IRQ1_INTS_CH8_LSB    _u(8)
#define PWM_IRQ1_INTS_CH8_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH7
#define PWM_IRQ1_INTS_CH7_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH7_BITS   _u(0x00000080)
#define PWM_IRQ1_INTS_CH7_MSB    _u(7)
#define PWM_IRQ1_INTS_CH7_LSB    _u(7)
#define PWM_IRQ1_INTS_CH7_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH6
#define PWM_IRQ1_INTS_CH6_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH6_BITS   _u(0x00000040)
#define PWM_IRQ1_INTS_CH6_MSB    _u(6)
#define PWM_IRQ1_INTS_CH6_LSB    _u(6)
#define PWM_IRQ1_INTS_CH6_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH5
#define PWM_IRQ1_INTS_CH5_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH5_BITS   _u(0x00000020)
#define PWM_IRQ1_INTS_CH5_MSB    _u(5)
#define PWM_IRQ1_INTS_CH5_LSB    _u(5)
#define PWM_IRQ1_INTS_CH5_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH4
#define PWM_IRQ1_INTS_CH4_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH4_BITS   _u(0x00000010)
#define PWM_IRQ1_INTS_CH4_MSB    _u(4)
#define PWM_IRQ1_INTS_CH4_LSB    _u(4)
#define PWM_IRQ1_INTS_CH4_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH3
#define PWM_IRQ1_INTS_CH3_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH3_BITS   _u(0x00000008)
#define PWM_IRQ1_INTS_CH3_MSB    _u(3)
#define PWM_IRQ1_INTS_CH3_LSB    _u(3)
#define PWM_IRQ1_INTS_CH3_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH2
#define PWM_IRQ1_INTS_CH2_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH2_BITS   _u(0x00000004)
#define PWM_IRQ1_INTS_CH2_MSB    _u(2)
#define PWM_IRQ1_INTS_CH2_LSB    _u(2)
#define PWM_IRQ1_INTS_CH2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH1
#define PWM_IRQ1_INTS_CH1_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH1_BITS   _u(0x00000002)
#define PWM_IRQ1_INTS_CH1_MSB    _u(1)
#define PWM_IRQ1_INTS_CH1_LSB    _u(1)
#define PWM_IRQ1_INTS_CH1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PWM_IRQ1_INTS_CH0
#define PWM_IRQ1_INTS_CH0_RESET  _u(0x0)
#define PWM_IRQ1_INTS_CH0_BITS   _u(0x00000001)
#define PWM_IRQ1_INTS_CH0_MSB    _u(0)
#define PWM_IRQ1_INTS_CH0_LSB    _u(0)
#define PWM_IRQ1_INTS_CH0_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_PWM_H

